#include <iostream>
#include <map>
#include <vector>
#include <windows.h>

using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    string buf;
    map <string, int> mp{
        {"Ужгород",407},
        {"Івано-Франківськ",136},
        {"Львів",275},
        {"Тернопіль",173},
        {"Луцьк",332},
        {"Рівне",322},
        {"Хмельницький",188},
        {"Житомир",390},
        {"Вінниця",289},
        {"Одеса",683},
        {"Миколаїв",700},
        {"Київ",528},
        {"Черкаси",600},
        {"Кропивницький",579},
        {"Чернігів",671},
        {"Суми",863},
        {"Полтава",834},
        {"Херсон",793},
        {"Дніпро",832},
        {"Запоріжжя",895},
        {"Донецьк",1101},
        {"Луганськ",1227},
        {"Сімферополь",1104}
    };
    cout << "Чернівці - ";
    cin >> buf;
    cout << "(" << mp.find(buf)->second << " km)\n\n";
}
